const CategoryActive = ({ ...props }) => {
    return (
        <svg width="46px" height="46px" viewBox="0 0 46 46" {...props}>
            <title>编组 57备份@2x</title>
            <desc>Created with Sketch.</desc>
            <defs>
                <linearGradient
                    x1="64.7709063%"
                    y1="65.8403196%"
                    x2="12.4965079%"
                    y2="24.9776864%"
                    id="linearGradient-1"
                >
                    <stop stopColor="#FF7F00" offset="0%"></stop>
                    <stop stopColor="#FFD664" offset="100%"></stop>
                </linearGradient>
                <linearGradient
                    x1="0.00187495899%"
                    y1="16.3593218%"
                    x2="79.391576%"
                    y2="85.8295111%"
                    id="linearGradient-2"
                >
                    <stop stopColor="#FFD664" offset="0%"></stop>
                    <stop stopColor="#FF7F00" offset="100%"></stop>
                </linearGradient>
            </defs>
            <g id="页面-1" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
                <g id="tab-切图" transform="translate(-478.000000, -329.000000)">
                    <g id="编组" transform="translate(478.000000, 329.000000)">
                        <image
                            id="Bitmap"
                            opacity="0"
                            x="1"
                            y="1"
                            width="44"
                            height="44"
                            xlinkHref="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACwAAAAsCAYAAAAehFoBAAAABGdBTUEAALGOfPtRkwAAAIFJREFUWAnt0rENgEAMxVBg/wGzDUiUrn1FJNO5+Yrecc/Mey36nkW3/qd28OkXSzhhCPRLAETPhHVSDCYMED0T1kkxmDBA9ExYJ8VgwgDRM2GdFIMJA0TPhHVSDCYMED0T1kkxmDBA9ExYJ8VgwgDRM2GdFIMJA0TPhHVSDK4T/gCldAPfJSpuWAAAAABJRU5ErkJggg=="
                        ></image>
                        <g id="编组-57备份" transform="translate(1.000000, 1.000000)">
                            <path
                                d="M15.5588293,20.6117106 L4.67787967,20.6117106 C2.10520325,20.6117106 -4.11768181e-13,18.5065073 -4.11768181e-13,15.9338309 L-4.11768181e-13,5.0528813 C-4.11768181e-13,2.48020488 2.10520325,0.375001626 4.67787967,0.375001626 L15.5588293,0.375001626 C18.1315057,0.375001626 20.2367089,2.48020488 20.2367089,5.0528813 L20.2367089,15.9338309 C20.2367089,18.5065073 18.1315057,20.6117106 15.5588293,20.6117106"
                                id="Fill-35"
                                fill="url(#linearGradient-1)"
                            ></path>
                            <path
                                d="M35.2183839,2.21878264 C34.7380257,1.73842443 34.1046576,1.5 33.4721737,1.5 C32.8396897,1.5 32.2063216,1.73842443 31.7260273,2.21871871 L25.1970788,8.7468802 C24.7172586,9.22694519 24.4790143,9.8606023 24.4790143,10.4932577 C24.4790143,11.1257169 24.717124,11.7590901 25.1971428,12.2391089 L31.7260273,18.7679935 C32.2063216,19.2482878 32.8396897,19.4867122 33.4721737,19.4867122 C34.1046576,19.4867122 34.7380257,19.2482878 35.21832,18.7679935 L41.7472045,12.2391089 C42.2272234,11.7590901 42.465333,11.1257169 42.465333,10.4932577 C42.465333,9.8606023 42.2270887,9.22694519 41.7469342,8.74654587 L35.2183839,2.21878264 Z"
                                id="Stroke-37"
                                stroke="url(#linearGradient-2)"
                                strokeWidth="3"
                            ></path>
                            <path
                                d="M15.5588293,43.3015948 L4.67787967,43.3015948 C2.10520325,43.3015948 -4.11768181e-13,41.1963915 -4.11768181e-13,38.6237151 L-4.11768181e-13,27.7427655 C-4.11768181e-13,25.1700891 2.10520325,23.0648859 4.67787967,23.0648859 L15.5588293,23.0648859 C18.1315057,23.0648859 20.2367089,25.1700891 20.2367089,27.7427655 L20.2367089,38.6237151 C20.2367089,41.1963915 18.1315057,43.3015948 15.5588293,43.3015948"
                                id="Fill-38"
                                fill="url(#linearGradient-1)"
                            ></path>
                            <path
                                d="M39.3218842,43.3015948 L28.4409346,43.3015948 C25.8682582,43.3015948 23.763055,41.1963915 23.763055,38.6237151 L23.763055,27.7427655 C23.763055,25.1700891 25.8682582,23.0648859 28.4409346,23.0648859 L39.3218842,23.0648859 C41.8945607,23.0648859 43.9997639,25.1700891 43.9997639,27.7427655 L43.9997639,38.6237151 C43.9997639,41.1963915 41.8945607,43.3015948 39.3218842,43.3015948"
                                id="Fill-40"
                                fill="url(#linearGradient-1)"
                            ></path>
                        </g>
                    </g>
                </g>
            </g>
        </svg>
    );
};

export default CategoryActive;
